---
Description: download Firefox for Linux
Identifier: com.github.macadmins.download.Firefox-Linux
Input:
  NAME: Firefox-Linux
  os: linux64
  filename: firefox.tar.xz
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=linux64&lang=en-US
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=osx&lang=en-US
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=win64&lang=en-US
MinimumVersion: "2.3"
ParentRecipe: com.github.macadmins.download.Firefox-Mac
