---
Description: Download firefox for Windows
Identifier: com.github.macadmins.download.Firefox-Win
Input:
  NAME: Firefox-Win
  filename: FirefoxSetup.exe
  os: win64
MinimumVersion: "2.3"
ParentRecipe: com.github.macadmins.download.Firefox-Mac
