---
Description: Download firefox for mac
Identifier: com.github.macadmins.download.Firefox-Mac
Input:
  NAME: Firefox-Mac
  filename: Firefox.dmg
  os: osx
MinimumVersion: "2.3"
Process:
  - Processor: com.github.jgstew.SharedProcessors/URLDownloaderPython
    Arguments:
      url: https://download.mozilla.org/?product=firefox-latest-ssl&os=%os%&lang=en-US
      COMPUTE_HASHES: true

  - Processor: EndOfCheckPhase
