---
Description: Creates a bigfix install fixlet for the latest version of Firefox
Identifier: com.github.macadmins.bigfix.Firefox-Win
Input:
  NAME: "Firefox"
  DisplayName: "Mozilla Firefox"
  OS: win64
  filename: FirefoxSetup.exe
  # https://download.mozilla.org/?product=firefox-latest-ssl&os=linux64&lang=en-US
  # https://download.mozilla.org/?product=firefox-msi-latest-ssl&os=win64&lang=en-US
MinimumVersion: "2.3"
ParentRecipe: com.github.macadmins.download.Firefox-Win
Process:
  - Processor: com.github.jgstew.SharedProcessors/BigFixPrefetchItem
    Arguments:
      prefetch_url: "%download_url%"

  - Processor: com.github.jgstew.SharedProcessors/BigFixSetupTemplateDictionary

  - Processor: com.github.jgstew.SharedProcessors/TemplateDictionaryAppendInput

  - Processor: com.github.jgstew.SharedProcessors/ContentFromTemplate
    Arguments:
      # use UNIX style paths so this works on Windows and non-Windows:
      template_file_path: "%RECIPE_DIR%/Firefox-Win.bigfix.install.template.bes"
      content_file_pathname: "%RECIPE_CACHE_DIR%/%NAME%-Install.bes"

  # - Processor: com.github.jgstew.SharedProcessors/BESImport

  # - Processor: com.github.jgstew.SharedProcessors/BigFixActioner
